/* Generated from data/equipment.json. */
#include "fish_equipment.h"
const fish_rod_t fish_rods[] = {
    {"竹竿", 88, 90},
    {"玻纤竿", 116, 100},
    {"碳素竿", 140, 110},
};
const fish_line_set_t fish_line_sets[] = {
    {"细线小钩", "小钩", 14000, 600, 75, 110, 18, 160, 300, {96, 94, 92}},
    {"通用线钩", "中钩", 18000, 800, 100, 100, 28, 100, 1500, {76, 74, 70}},
    {"强韧大钩", "大钩", 26000, 1000, 140, 90, 45, 65, 6500, {28, 50, 62}},
};
const fish_float_t fish_floats[] = {
    {"红白漂", 49993, 61207, 4, 3, 0, 0},
    {"鹅毛漂", 52427, 61207, 6, 2, 0, 15},
    {"夜光漂", 36592, 59226, 4, 4, 15, 0},
};
const fish_bait_t fish_baits[] = {
    {"蚯蚓", "泛用性很好的饵料", {5, 3, 4, 4, 4, 1, 6, 2, 1, 1, 3}},
    {"米饭", "主食，素食主义之选", {6, 3, 1, 0, 1, 0, 1, 5, 0, 0, 1}},
    {"面饵", "我闻了都觉得香", {4, 7, 1, 0, 1, 0, 1, 3, 0, 0, 1}},
    {"小鱼", "吓跑卡拉米，吸引掠食者", {0, 1, 2, 7, 1, 8, 3, 0, 8, 1, 2}},
    {"虾饵", "大鱼吃小鱼，小鱼吃虾米", {2, 2, 5, 4, 7, 4, 5, 2, 6, 1, 7}},
    {"普通假饵", "塑料味", {2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2}},
};
